tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

file "./#{`hostname -s`.strip}.Brewfile"

#### TERMINAL SETUP DEPENDENCIES
brew "bat"                          # cat but with formatting
brew "fd"                           # find alternative
cask "font-fira-code-nerd-font"     # nerd font
brew "fzf"                          # Fuzzy finder
cask "iterm2"                       # iterm2 terminal emulator
brew "lsd"                          # Clone of ls with colorful output, file type icons, and more
brew "navi"                         # Interactive cheatsheet tool
brew "starship"                     # Starship prompt

#### OTHER TERMINAL UTILS
brew "bottom"                       # alternative to htop
brew "broot"                        # New way to see and navigate directory trees
brew "curl"                         # curl - installing for the completions which are missing from macos
brew "ffmpeg"                       # Play, record, convert, and stream audio and video
brew "gum"                          # Tool for creating interactive scripts
brew "htop"                         # Realtime info on running processes
brew "jq"                           # Json processor
brew "ripgrep"                      # better version of grep
brew "socat"                        # Socket CAT: netcat on steroids
brew "vhs"                          # Terminal recorder
brew "websocat"                     # CLI for WebSockets
brew "xxh"                          # Bring your favorite shell wherever you go through the ssh (try with $ xxh +I xxh-plugin-zsh-ohmyzsh && source xxh.zsh myhost)

#### BROWSERS
cask "firefox"                      # firefox browser
cask "google-chrome"                # chrome browser

#### DEVELOPMENT TOOLS / APPS
# cask "android-studio"               # Android Studio (~/Library/Android/sdk/platform-tools/adb, ~/Library/Android/sdk/emulator/emulator)
brew "awscli"                       # AWS cli
brew "azure-cli"                    # Azure cli
cask "drawio"                       # drawio app
brew "fnm"                          # faster nvm
brew "git"                          # Git
brew "gh"                           # Github cli
cask "miniconda"                    # Environment management for python
# cask "ngrok"                        # Reverse proxy, secure introspectable tunnels to localhost
# brew "terraform"                    # Terraform
cask "visual-studio-code"           # vscode

#### VIRTUALISATION / CONTAINERISATION
cask "docker"                       # Docker binary and desktop
# brew "qemu"                         # machine emulator and virtualizer
# cask "utm"                          # UI for qemu
# cask "xquartz"                      # XQuartz - X11
                                      # $ defaults write org.xquartz.X11 nolisten_tcp 0; # Allow Connections from Network Clients
                                      # $ open -a /Applications/Utilities/XQuartz.app/
                                      # Docker Args: -e DISPLAY="$(localip)":0 -e XAUTHORITY=/.Xauthority -v ~/.Xauthority:/.Xauthority

#### 3D PRINTING
# cask "freecad"                      # 3D CAD
# cask "ultimaker-cura"               # 3D printing slicer
