tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "awscli"                       # AWS cli
brew "azure-cli"                    # Azure cli
brew "bat"                          # cat but with formatting
brew "bottom"                       # alternative to htop
brew "broot"                        # New way to see and navigate directory trees
brew "chafa"                        # render images in the terminal
brew "curl"                         # curl - installing for the completions which are missing from macos
brew "direnv"                       # directory environment loader with nix support
brew "exa"                          # modern replacement for ls
brew "fd"                           # find alternative
brew "ffmpeg"                       # Play, record, convert, and stream audio and video
brew "fnm"                          # faster nvm
brew "fzf"                          # Fuzzy finder
brew "gifsicle"                     # GIF image/animation creator/editor
brew "git"                          # Git
brew "git-town"                     # Git workflows
brew "gum"                          # Tool for creating interactive scripts
brew "htop"                         # Realtime info on running processes
brew "jq"                           # Json processor
brew "navi"                         # Interactive cheatsheet tool
# brew "qemu"                         # machine emulator and virtualizer
brew "ripgrep"                      # better version of grep
brew "socat"                        # Socket CAT: netcat on steroids
brew "starship"                     # Starship prompt
# brew "terraform"                    # Terraform
brew "vhs"                          # Terminal recorder
brew "websocat"                     # CLI for WebSockets

# cask "android-studio"               # Android Studio (~/Library/Android/sdk/platform-tools/adb, ~/Library/Android/sdk/emulator/emulator)
cask "docker"                       # Docker binary and desktop
cask "drawio"                       # drawio app
cask "font-fira-code-nerd-font"     # nerd font
# cask "freecad"                      # 3D CAD
cask "firefox"                      # firefox browser
cask "google-chrome"                # chrome browser
cask "iina"                         # modern media player
cask "kitty"                        # kitty terminal
cask "messenger"                    # Facebook messenger
cask "microsoft-teams"              # Microsoft Teams ($ sudo softwareupdate --install-rosetta)
cask "miniconda"                    # Environment management for python
# cask "ngrok"                        # Reverse proxy, secure introspectable tunnels to localhost
cask "raycast"                      # spotlight alternative
cask "rectangle"                    # drag / drop window docking
cask "shottr"                       # Screenshot tool
cask "steam"                        # steam
# cask "ultimaker-cura"               # 3D printing slicer
# cask "utm"                          # UI for qemu
cask "visual-studio-code"           # vscode
# cask "xquartz"                      # XQuartz - X11
                                      # $ defaults write org.xquartz.X11 nolisten_tcp 0; # Allow Connections from Network Clients
                                      # $ open -a /Applications/Utilities/XQuartz.app/
                                      # Docker Args: -e DISPLAY="$(localip)":0 -e XAUTHORITY=/.Xauthority -v ~/.Xauthority:/.Xauthority
